Hexagonal/UserService/Adapters/SOAPAdapter/loginReq.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:usr="http://p.lodz.pl/users">
    <soapenv:Header/>
    <soapenv:Body>
        <usr:loginUser>
            <usr:username>JEscobarr</usr:username>
            <usr:password>a</usr:password>
        </usr:loginUser>
    </soapenv:Body>
</soapenv:Envelope>
